Test Plan.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group">
        <intProp name="ThreadGroup.num_threads">10</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">10</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Server health">
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8088</stringProp>
          <stringProp name="HTTPSampler.path">/events/server-health</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;server_id&quot;: &quot;${__UUID()}&quot;,&#xd;
  &quot;sent_timestamp&quot;: &quot;2026-01-08T22:15:30Z&quot;,&#xd;
  &quot;batch_id&quot;: &quot;${__UUID()}&quot;,&#xd;
  &quot;server_region&quot;: &quot;ca-west-1&quot;,&#xd;
  &quot;readings&quot;: [&#xd;
    {&#xd;
      &quot;server_id&quot;: &quot;${__UUID()}&quot;,&#xd;
      &quot;server_location&quot;: &quot;Vancouver&quot;,&#xd;
      &quot;active_players&quot;: ${__Random(50,500)},&#xd;
      &quot;cpu_usage&quot;: ${__Random(10,95)},&#xd;
      &quot;ram_usage&quot;: ${__Random(20,90)},&#xd;
      &quot;recorded_timestamp&quot;: &quot;2026-01-08T22:15:30Z&quot;&#xd;
    }&#xd;
  ]&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="player telemetry">
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8088</stringProp>
          <stringProp name="HTTPSampler.path">/events/player-telemetry</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;server_id&quot;: &quot;${__UUID()}&quot;,&#xd;
  &quot;sent_timestamp&quot;: &quot;2026-01-08T22:16:10Z&quot;,&#xd;
  &quot;batch_id&quot;: &quot;${__UUID()}&quot;,&#xd;
  &quot;server_region&quot;: &quot;ca-west-1&quot;,&#xd;
  &quot;events&quot;: [&#xd;
    {&#xd;
      &quot;player_id&quot;: &quot;${__UUID()}&quot;,&#xd;
      &quot;event_timestamp&quot;: &quot;2026-01-08T22:16:01Z&quot;,&#xd;
      &quot;player_ping&quot;: ${__Random(20,120)},&#xd;
      &quot;player_level&quot;: ${__Random(1,100)},&#xd;
      &quot;action&quot;: &quot;login&quot;&#xd;
    },&#xd;
    {&#xd;
      &quot;player_id&quot;: &quot;${__UUID()}&quot;,&#xd;
      &quot;event_timestamp&quot;: &quot;2026-01-08T22:16:05Z&quot;,&#xd;
      &quot;player_ping&quot;: ${__Random(20,120)},&#xd;
      &quot;player_level&quot;: ${__Random(1,100)},&#xd;
      &quot;action&quot;: &quot;kill&quot;&#xd;
    }&#xd;
  ]&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
        </hashTree>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>